Tekla.Structures.Analysis.AnalysisPartCompositeProperties
The AnalysisPartCompositeProperties class contains information related to analysis part composite properties.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties._CompositeBeamType
The composite beam type.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties._CompositeBeamSlabMaterial
The composite beam slab material.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties._CompositeBeamSlabThickness
The composite beam slab thickness.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties._CompositeBeamWidthModeLeft
The composite beam width left.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties._CompositeBeamWidthLeft
The composite beam width left.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties._CompositeBeamWidthModeRight
The composite beam width right.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties._CompositeBeamWidthRight
The composite beam width right.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties._CompositeBeamWidthFromSpanFactor
The composite beam width right from span factor.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamType
The composite beam type.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamSlabMaterial
The composite beam slab material.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamSlabThickness
The composite beam slab thickness.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamWidthModeLeft
The composite beam width mode left.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamWidthLeft
The composite beam width left.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamWidthModeRight
The composite beam width mode right.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamWidthRight
The composite beam width right.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamWidthFromSpanFactor
The composite beam width from span factor.